layer {
  name: "train-data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.015164888
    mirror: true
    crop_size: 12
    mean_value: 127.5
  }
  data_param {
    source: "/home/kjaget/DIGITS/digits/jobs/20160820-093110-89bc/train_db"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "val-data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.015164888
    mirror: true
    crop_size: 12
    mean_value: 127.5
  }
  data_param {
    source: "/home/kjaget/DIGITS/digits/jobs/20160820-093110-89bc/val_db"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "conv1_d12"
  type: "Convolution"
  bottom: "data"
  top: "conv1_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 12
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1_d12"
  type: "Pooling"
  bottom: "conv1_d12"
  top: "pool1_d12"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1_d12"
  type: "ReLU"
  bottom: "pool1_d12"
  top: "pool1_d12"
}
layer {
  name: "fc1_d12"
  type: "InnerProduct"
  bottom: "pool1_d12"
  top: "fc1_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 12
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_d12"
  type: "ReLU"
  bottom: "fc1_d12"
  top: "fc1_d12"
}
layer {
  name: "drop1_d12"
  type: "Dropout"
  bottom: "fc1_d12"
  top: "fc1_d12"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc2_d12"
  type: "InnerProduct"
  bottom: "fc1_d12"
  top: "fc2_d12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc2_d12"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc2_d12"
  bottom: "label"
  top: "loss"
}
